<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 2 to add, 1 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_identity_platform_config.default will be updated in-place
  ~ resource "google_identity_platform_config" "default" {
      ~ authorized_domains         = [
            # (1 unchanged element hidden)
            "dungeon-studio-genshin-dev.web.app",
          + "genshin.dungeon.studio",
        ]
        id                         = "projects/dungeon-studio-genshin-dev/config"
        name                       = "projects/179636804167/config"
        # (2 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # google_secret_manager_secret.firebase_auth_google_client_id will be created
  + resource "google_secret_manager_secret" "firebase_auth_google_client_id" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "dungeon-studio-genshin-dev"
      + secret_id             = "firebase-auth-google-client-id"
      + terraform_labels      = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.firebase_auth_google_client_secret will be created
  + resource "google_secret_manager_secret" "firebase_auth_google_client_secret" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "dungeon-studio-genshin-dev"
      + secret_id             = "firebase-auth-google-client-secret"
      + terraform_labels      = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```
</details>